{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 64, "activation": "linear", "input_dtype": "float32", "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "batch_input_shape": [null, 1, 150, 3], "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "th", "pool_size": [10, 1], "strides": [10, 1], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.6, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 4, "activation": "linear", "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "th", "pool_size": [2, 1], "strides": [2, 1], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 64, "activation": "linear", "input_dtype": "float32", "b_regularizer": null, "W_regularizer": null, "nb_row": 10, "batch_input_shape": [null, 1, 150, 3], "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "dim_ordering": "th", "pool_size": [10, 1], "strides": [10, 1], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.6, "trainable": true, "name": "dropout_3"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 4, "activation": "linear", "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "trainable": true, "dim_ordering": "th", "pool_size": [2, 1], "strides": [2, 1], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 64, "activation": "linear", "input_dtype": "float32", "b_regularizer": null, "W_regularizer": null, "nb_row": 20, "batch_input_shape": [null, 1, 150, 3], "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_5", "trainable": true, "dim_ordering": "th", "pool_size": [10, 1], "strides": [10, 1], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.6, "trainable": true, "name": "dropout_5"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_6", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 4, "activation": "linear", "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_6", "trainable": true, "dim_ordering": "th", "pool_size": [2, 1], "strides": [2, 1], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_6"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_7", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 64, "activation": "linear", "input_dtype": "float32", "b_regularizer": null, "W_regularizer": null, "nb_row": 25, "batch_input_shape": [null, 1, 150, 3], "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_7", "trainable": true, "dim_ordering": "th", "pool_size": [10, 1], "strides": [10, 1], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.6, "trainable": true, "name": "dropout_7"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_8", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 4, "activation": "linear", "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_8", "trainable": true, "dim_ordering": "th", "pool_size": [2, 1], "strides": [2, 1], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_8"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_9", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 64, "activation": "linear", "input_dtype": "float32", "b_regularizer": null, "W_regularizer": null, "nb_row": 30, "batch_input_shape": [null, 1, 150, 3], "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_9", "trainable": true, "dim_ordering": "th", "pool_size": [10, 1], "strides": [10, 1], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.6, "trainable": true, "name": "dropout_9"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_10", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 4, "activation": "linear", "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_10", "trainable": true, "dim_ordering": "th", "pool_size": [2, 1], "strides": [2, 1], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_10"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_5"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_11", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 64, "activation": "linear", "input_dtype": "float32", "b_regularizer": null, "W_regularizer": null, "nb_row": 40, "batch_input_shape": [null, 1, 150, 3], "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_11", "trainable": true, "dim_ordering": "th", "pool_size": [10, 1], "strides": [10, 1], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.6, "trainable": true, "name": "dropout_11"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_12", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 4, "activation": "linear", "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_12", "trainable": true, "dim_ordering": "th", "pool_size": [2, 1], "strides": [2, 1], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_12"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_6"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_13", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 64, "activation": "linear", "input_dtype": "float32", "b_regularizer": null, "W_regularizer": null, "nb_row": 45, "batch_input_shape": [null, 1, 150, 3], "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_13", "trainable": true, "dim_ordering": "th", "pool_size": [10, 1], "strides": [10, 1], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.6, "trainable": true, "name": "dropout_13"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_14", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 4, "activation": "linear", "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_14", "trainable": true, "dim_ordering": "th", "pool_size": [2, 1], "strides": [2, 1], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_14"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_7"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_15", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 64, "activation": "linear", "input_dtype": "float32", "b_regularizer": null, "W_regularizer": null, "nb_row": 50, "batch_input_shape": [null, 1, 150, 3], "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_15", "trainable": true, "dim_ordering": "th", "pool_size": [10, 1], "strides": [10, 1], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.6, "trainable": true, "name": "dropout_15"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_16", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 4, "activation": "linear", "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_16", "trainable": true, "dim_ordering": "th", "pool_size": [2, 1], "strides": [2, 1], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_16"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_8"}}]}], "name": "merge_1", "concat_axis": 1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 60}}, {"class_name": "Dropout", "config": {"p": 0.8, "trainable": true, "name": "dropout_17"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 3}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_18"}}]}